Task 1
There are three different tables as given above. Please make three dataframe in python
and save them as three .csv files.

Step 1 : Create DataFrames

In [75]:
import pandas as pd
import numpy as np

In [76]:
# 1. Project DataFrame (14 projects with repeated IDs)
project_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A002', 'A005',
           'A003', 'A001', 'A003', 'A001', 'A004', 'A004', 'A005'],
    'Project': ['Project 1', 'Project 2', 'Project 3', 'Project 4', 'Project 5',
                'Project 6', 'Project 7', 'Project 8', 'Project 9', 'Project 10',
                'Project 11', 'Project 12', 'Project 13', 'Project 14'],
    'Cost': [1002000, 2000000, 4500000, 5500000,None,680000,400000,350000,None,
             300000,2000000,1000000,3000000,200000],
    'Status': ['Finished', 'Ongoing', 'Finished', 'Ongoing', 'Finished',
               'Failed', 'Finished','Failed','Ongoing', 'Finished',
               'Failed', 'Ongoing', 'Finished', 'Finished']
}
project_df = pd.DataFrame(project_data)

In [77]:
# 2. Employee DataFrame
employee_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],
    'Gender': ['M', 'F', 'M', 'F', 'F'],
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],
    'Age': [25, 27, 29, 31, 30]
}
employee_df = pd.DataFrame(employee_data)

In [78]:
# 3. Seniority Level DataFrame
seniority_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Designation Level': [2, 2, 3, 2, 3]
}
seniority_df = pd.DataFrame(seniority_data)

Step 2 : Save as CSV Files

In [79]:
project_df.to_csv('project.csv', index=False)

In [80]:
employee_df.to_csv('employee.csv', index=False)

In [81]:
seniority_df.to_csv('seniority.csv', index=False)

Task 2
The cost column in the dataframe “Project” has some missing values. Your task is to
compute these missing values. Replace the missing values by running average. You
should use the “For” loop for this task.

In [82]:
#read project table
df = pd.read_csv("project.csv")

In [83]:
print(df)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [84]:
#see a missing values
print(df.isnull().sum)

<bound method DataFrame.sum of        ID  Project   Cost  Status
0   False    False  False   False
1   False    False  False   False
2   False    False  False   False
3   False    False  False   False
4   False    False   True   False
5   False    False  False   False
6   False    False  False   False
7   False    False  False   False
8   False    False   True   False
9   False    False  False   False
10  False    False  False   False
11  False    False  False   False
12  False    False  False   False
13  False    False  False   False>

In [85]:
# Replace the missing values by running average. 
total = 0
count = 0

for i in range(len(df)):
    if pd.isna(df.loc[i, 'Cost']):
        if count == 0:
            df.loc[i, 'Cost'] = 0  # if all previous are NaN
        else:
            df.loc[i, 'Cost'] = total / count
    total += df.loc[i, 'Cost']
    count += 1

In [86]:
print(df)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

Task 3
Split the name column in the Employee dataframe into two new columns “First Name”,
and “LastName” and remove the older “name” column.b

In [87]:
# Read employee table
df1 = pd.read_csv("employee.csv")

In [88]:
print(df1)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [89]:
#Split the name column in the Employee dataframe into two new columns “First Name”, and “LastName” 
df1[['First_Name', 'Last_Name']] = df1['Name'].str.split(' ',n=1, expand=True)

In [90]:
print(df1)

     ID             Name Gender     City  Age First_Name  Last_Name
0  A001       John Alter      M    Paris   25       John      Alter
1  A002  Alice Luxumberg      F   London   27      Alice  Luxumberg
2  A003    Tom Sabestine      M   Berlin   29        Tom  Sabestine
3  A004       Nina Adgra      F  Newyork   31       Nina      Adgra
4  A005        Amy Johny      F   Madrid   30        Amy      Johny

In [91]:
#remove the older “name” column
df1.drop(columns = ["Name"],inplace = True)

In [92]:
print(df1)

     ID Gender     City  Age First_Name  Last_Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

Task 4
Join all three dataframes in one single dataframe. Name it “Final”

In [93]:
# read "seniority"
df2 = pd.read_csv("seniority.csv")

In [94]:
print(df2)

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [95]:
# join project and employee table in one table by using left join
Merge = pd.merge(df,df1, on = "ID", how= "left")

In [96]:
# After join project and employee table we join seniority table
Final = pd.merge(Merge,df2, on = "ID", how= "left")

In [97]:
print(Final)

      ID     Project       Cost    Status Gender     City  Age First_Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last_Name  Designation Level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

Task 5
Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project
cost only to employees who have finished the projects.

In [98]:
# Add a new bonus column in the Final dataframe.
Final["Bonus"] = Final.apply(lambda Final:Final["Cost"]*0.05 #5% bonus 
if Final["Status"] == "Finished"
else "No Bonus",axis = 1)

In [99]:
print(Final)

      ID     Project       Cost    Status Gender     City  Age First_Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last_Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2  No Bonus
2   Sabestine                  3  225000.0
3       Adgra                  2  No Bonus
4       Johny                  3  162525.0
5   Luxumberg                  2  No Bonus
6       Johny                  3   20000.0
7   Sabestine                  3  No Bonus
8       Alter                  2  No Bonus
9   Sabestine                  3   15000.0
10      Alter                  2  No Bonus
11      Adgra                  2  No Bonus
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

Task 6
Demote the designation level by 1, whose projects have status “fail”. Delete the
employees record whose designation level is above 4.

In [100]:
#Demote by 1 where Status if "Failed"
Final["Designation Level"] = Final.apply(lambda Final: Final["Designation Level"] - 1
if Final["Status"] == "Failed"
else Final["Designation Level"], axis = 1)

In [101]:
print(Final)

      ID     Project       Cost    Status Gender     City  Age First_Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last_Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2  No Bonus
2   Sabestine                  3  225000.0
3       Adgra                  2  No Bonus
4       Johny                  3  162525.0
5   Luxumberg                  1  No Bonus
6       Johny                  3   20000.0
7   Sabestine                  2  No Bonus
8       Alter                  2  No Bonus
9   Sabestine                  3   15000.0
10      Alter                  1  No Bonus
11      Adgra                  2  No Bonus
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

In [102]:
# Delete the employees record whose designation level is above 4.
Final = Final[Final["Designation Level"] <= 4]

In [103]:
print(Final)

      ID     Project       Cost    Status Gender     City  Age First_Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last_Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2  No Bonus
2   Sabestine                  3  225000.0
3       Adgra                  2  No Bonus
4       Johny                  3  162525.0
5   Luxumberg                  1  No Bonus
6       Johny                  3   20000.0
7   Sabestine                  2  No Bonus
8       Alter                  2  No Bonus
9   Sabestine                  3   15000.0
10      Alter                  1  No Bonus
11      Adgra                  2  No Bonus
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

Task 7
Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [104]:
#Add “Mr.” and “Mrs.” to the first name column
Final["First_Name"] = Final.apply(
    lambda Final: "Mr. " + Final["First_Name"] if Final["Gender"] == "M" else "Mrs. " + Final["First_Name"],
    axis=1
)

In [105]:
print(Final)

      ID     Project       Cost    Status Gender     City  Age  First_Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25    Mr. John
1   A002   Project 2  2000000.0   Ongoing      F   London   27  Mrs. Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29     Mr. Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31   Mrs. Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30    Mrs. Amy
5   A002   Project 6   680000.0    Failed      F   London   27  Mrs. Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30    Mrs. Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29     Mr. Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25    Mr. John
9   A003  Project 10   300000.0  Finished      M   Berlin   29     Mr. Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25    Mr. John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31   Mrs. Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31   Mrs. Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30    Mrs. Amy

    Last_Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2  No Bonus
2   Sabestine                  3  225000.0
3       Adgra                  2  No Bonus
4       Johny                  3  162525.0
5   Luxumberg                  1  No Bonus
6       Johny                  3   20000.0
7   Sabestine                  2  No Bonus
8       Alter                  2  No Bonus
9   Sabestine                  3   15000.0
10      Alter                  1  No Bonus
11      Adgra                  2  No Bonus
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

In [106]:
#drop the gender column.
Final.drop("Gender", axis=1, inplace=True)

In [107]:
print(Final)

      ID     Project       Cost    Status     City  Age  First_Name  \
0   A001   Project 1  1002000.0  Finished    Paris   25    Mr. John
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs. Alice
2   A003   Project 3  4500000.0  Finished   Berlin   29     Mr. Tom
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs. Nina
4   A005   Project 5  3250500.0  Finished   Madrid   30    Mrs. Amy
5   A002   Project 6   680000.0    Failed   London   27  Mrs. Alice
6   A005   Project 7   400000.0  Finished   Madrid   30    Mrs. Amy
7   A003   Project 8   350000.0    Failed   Berlin   29     Mr. Tom
8   A001   Project 9  2210312.5   Ongoing    Paris   25    Mr. John
9   A003  Project 10   300000.0  Finished   Berlin   29     Mr. Tom
10  A001  Project 11  2000000.0    Failed    Paris   25    Mr. John
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs. Nina
13  A005  Project 14   200000.0  Finished   Madrid   30    Mrs. Amy

    Last_Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2  No Bonus
2   Sabestine                  3  225000.0
3       Adgra                  2  No Bonus
4       Johny                  3  162525.0
5   Luxumberg                  1  No Bonus
6       Johny                  3   20000.0
7   Sabestine                  2  No Bonus
8       Alter                  2  No Bonus
9   Sabestine                  3   15000.0
10      Alter                  1  No Bonus
11      Adgra                  2  No Bonus
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

Task 8
Promote designation level by 1 for the employees whose age is more than 29 years using
IF condition.

In [108]:
#Promote designation level by 1 for the employees whose age is more than 29 years
Final["Designation Level"] = Final.apply(lambda Final: Final["Designation Level"] + 1
if Final["Age"] >= 29
else Final["Designation Level"], axis = 1)

In [109]:
print(Final)

      ID     Project       Cost    Status     City  Age  First_Name  \
0   A001   Project 1  1002000.0  Finished    Paris   25    Mr. John
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs. Alice
2   A003   Project 3  4500000.0  Finished   Berlin   29     Mr. Tom
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs. Nina
4   A005   Project 5  3250500.0  Finished   Madrid   30    Mrs. Amy
5   A002   Project 6   680000.0    Failed   London   27  Mrs. Alice
6   A005   Project 7   400000.0  Finished   Madrid   30    Mrs. Amy
7   A003   Project 8   350000.0    Failed   Berlin   29     Mr. Tom
8   A001   Project 9  2210312.5   Ongoing    Paris   25    Mr. John
9   A003  Project 10   300000.0  Finished   Berlin   29     Mr. Tom
10  A001  Project 11  2000000.0    Failed    Paris   25    Mr. John
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs. Nina
13  A005  Project 14   200000.0  Finished   Madrid   30    Mrs. Amy

    Last_Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2  No Bonus
2   Sabestine                  4  225000.0
3       Adgra                  3  No Bonus
4       Johny                  4  162525.0
5   Luxumberg                  1  No Bonus
6       Johny                  4   20000.0
7   Sabestine                  3  No Bonus
8       Alter                  2  No Bonus
9   Sabestine                  4   15000.0
10      Alter                  1  No Bonus
11      Adgra                  3  No Bonus
12      Adgra                  3  150000.0
13      Johny                  4   10000.0

Task 9
Add the cost of all projects for each Employee and save it in new dataframe
“TotalProjCost” with three columns ID, First Name, and Total cos

In [110]:
# the cost of all projects for each Employee
# by using group by we find it
TotalProjCost = Final.groupby(["ID","First_Name"])["Cost"].sum().rename("Total cos")

In [111]:
print(TotalProjCost)

ID    First_Name
A001  Mr. John      5212312.5
A002  Mrs. Alice    2680000.0
A003  Mr. Tom       5150000.0
A004  Mrs. Nina     9500000.0
A005  Mrs. Amy      3850500.0
Name: Total cos, dtype: float64

Task 10
Print all the employee details whose city name contains the letter “o” in it.

In [112]:
#all the employee details whose city name contains the letter “o” in it.
Employees_city = Final[Final['City'].str.contains('o', case=False, na=False)][["ID","First_Name","Last_Name","Age","City"]]

In [113]:
#Remove Duplicate:keeps only first row for each employee ID
Employees_city_with_o = Employees_city.drop_duplicates(subset = "ID")

In [114]:
print(Employees_city_with_o)

     ID  First_Name  Last_Name  Age     City
1  A002  Mrs. Alice  Luxumberg   27   London
3  A004   Mrs. Nina      Adgra   31  Newyork